<%@ page contentType="text/html;charset=UTF-8" language="java" import="visp.yeararray,java.lang.*,java.util.*" pageEncoding="UTF-8" %>
<html>
<head>

<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
<title>全球鲨鱼伤人事件数据可视化</title>
<link href="style.css" rel="stylesheet" type="text/css" />
</head>
<body>

<script src="./echarts/echarts.js" charset="utf-8"></script>
	
<table width="1000" border="0" align="center" cellpadding="0" cellspacing="0" class="outer"  style="width:100%">
	<tr><td class="name" style="border:0px; background:#153123 ;width:100%" ;font-family:黑体"><span ><strong>we小组鲨鱼伤人事件信息可视化平台<strong></span></td></tr>

	<tr>
		<td valign="top">
			<table width="100%" border="0" align="center" cellpadding="0" cellspacing="0">
				<tr><div class="inner_copy"></div>
					<td valign="top" id="left">
						<table width="200" border="0" align="left" cellpadding="0" cellspacing="0">
							<tr><td height="3"></td></tr>
							<tr><td height="20" class="cat-head">总览</td></tr>
							<tr><td class="leftlinks"><a href="index.jsp" target="_parent">事件数总览</form></a></td></tr>
							<tr><td height="20" class="cat-head">地理位置信息</td></tr>
							<tr><td class="leftlinks"><a href="CountryDis_fin.jsp" target="_parent">国家分布</a></td></tr>
							<tr><td class="leftlinks"><a href="map_value_fin.jsp" target="_parent">地区分布</a></td></tr>
							<tr><td height="20" class="cat-head">事件发生时间信息</td></tr>
							<tr><td class="leftlinks"><a href="heatmap_fin.jsp" target="_parent">事件发生时间分布</a></td></tr>
							<tr><td class="leftlinks"><a href="3-2.jsp" target="_parent">各洲事件数随时间分布</a></td></tr>
							<tr><td height="20" class="cat-head">受害者信息</td></tr>
							<tr><td class="leftlinks"><a href="age_dis_fin.jsp" target="_parent">受害者年龄分布</a></td></tr>
							<tr><td class="leftlinks"><a href="river.jsp" target="_parent">受害者活动分布</a></td></tr>
							<tr><td class="leftlinks"><a href="sex_2.jsp" target="_parent">受害者性别分布</a></td></tr>
							<tr><td height="20" class="cat-head">鲨鱼种类信息</td></tr>
							<tr><td class="leftlinks"><a href="shark.jsp" target="_parent">鲨鱼种类分布</a></td></tr>
							<!--tr><td class="leftlinks"><a href="#" target="_parent"> Category Name</a></td></tr>
							<tr><td class="leftlinks"><a href="#" target="_parent"> Category Name</a></td></tr-->
						</table>
					</td>
					<td valign="top">
						<table width="800" border="0" align="left" cellpadding="0" cellspacing="0">
						
							<tr><td class="tag" id="header2">
							        <div id="main2" style="width:1000 ;height:600px;" align="left"></div></td></tr>	
							
		                </table>    
<script type="text/javascript">
//基于准备好的dom，初始化echarts实例
var myChart = echarts.init(document.getElementById('main2'));
var dataAfrica = [
[1500,1],//1500年以前的
[1510,0],//1500-1510
[1520,0],//1510-1520
[1530,0],//1520-1530
[1540,0],//1530-1540
[1550,0],//1540-1550
[1560,0],//1550-1560
[1570,0],//1560-1570
[1580,0],//1570-1580
[1590,0],//1580-1590
[1600,0],//1590-1600

[1610,0],//1600-1610
[1620,0],//10-20
[1630,0],//20-30
[1640,0],//30-40
[1650,2],//40-50
[1660,0],//50-60
[1670,0],//60-70
[1680,0],//70-80
[1690,0],//80-90
[1700,0],//90-00

[1710,0],//1700-1710
[1720,0],//10-20
[1730,0],//20-30
[1740,0],//30-40
[1750,0],//40-50
[1760,0],//50-60
[1770,0],//60-70;
[1780,1],//70-80
[1790,1],//80-90
[1800,0],//90-00

[1810,1],//1800-1810
[1820,0],//10-20
[1830,9],//20-30
[1840,0],//30-40
[1850,4],//40-50
[1860,0],//50-60
[1870,11],//60-70
[1880,0],//70-80
[1890,0],//80-90
[1900,0],//90-00

[1910,29],//1900-1910
[1920,0],//10-20
[1930,19],//20-30
[1940,0],//30-40
[1950,28],//40-50
[1960,67],//50-60
[1970,307],//60-70
[1980,129],//70-80
[1990,152],//80-90
[2000,151],//90-00

[2010,212],//2000-2010
[2020,139]//2010-2020
];


var dataAsia = [
[1500,0],//1500年以前的
[1510,0],//1500-1510
[1520,0],//1510-1520
[1530,0],//1520-1530
[1540,0],//1530-1540
[1550,0],//1540-1550
[1560,0],//1550-1560
[1570,0],//1560-1570
[1580,0],//1570-1580
[1590,0],//1580-1590
[1600,1],//1590-1600

[1610,0],//1600-1610
[1620,1],//10-20
[1630,0],//20-30
[1640,1],//30-40
[1650,2],//40-50
[1660,0],//50-60
[1670,0],//60-70
[1680,0],//70-80
[1690,0],//80-90
[1700,0],//90-00

[1710,0],//1700-1710
[1720,0],//10-20
[1730,0],//20-30
[1740,0],//30-40
[1750,0],//40-50
[1760,0],//50-60
[1770,0],//60-70;
[1780,0],//70-80
[1790,0],//80-90
[1800,0],//90-00

[1810,0],//1800-1810
[1820,0],//10-20
[1830,9],//20-30
[1840,0],//30-40
[1850,3],//40-50
[1860,0],//50-60
[1870,5],//60-70
[1880,8],//70-80
[1890,0],//80-90
[1900,13],//90-00

[1910,13],//1900-1910
[1920,0],//10-20
[1930,0],//20-30
[1940,0],//30-40
[1950,47],//40-50
[1960,54],//50-60
[1970,0],//60-70
[1980,0],//70-80
[1990,35],//80-90
[2000,0],//90-00

[2010,0],//2000-2010
[2020,0]//2010-2020

];

var dataAtlantic = [
[1500,0],//1500年以前的
[1510,0],//1500-1510
[1520,0],//1510-1520
[1530,0],//1520-1530
[1540,0],//1530-1540
[1550,0],//1540-1550
[1560,0],//1550-1560
[1570,0],//1560-1570
[1580,0],//1570-1580
[1590,0],//1580-1590
[1600,0],//1590-1600

[1610,0],//1600-1610
[1620,0],//10-20
[1630,0],//20-30
[1640,0],//30-40
[1650,0],//40-50
[1660,0],//50-60
[1670,0],//60-70
[1680,0],//70-80
[1690,0],//80-90
[1700,0],//90-00

[1710,1],//1700-1710
[1720,0],//10-20
[1730,0],//20-30
[1740,0],//30-40
[1750,0],//40-50
[1760,0],//50-60
[1770,0],//60-70;
[1780,0],//70-80
[1790,0],//80-90
[1800,0],//90-00

[1810,0],//1800-1810
[1820,0],//10-20
[1830,0],//20-30
[1840,0],//30-40
[1850,0],//40-50
[1860,0],//50-60
[1870,0],//60-70
[1880,0],//70-80
[1890,0],//80-90
[1900,11],//90-00

[1910,0],//1900-1910
[1920,0],//10-20
[1930,0],//20-30
[1940,0],//30-40
[1950,27],//40-50
[1960,0],//50-60
[1970,30],//60-70
[1980,0],//70-80
[1990,0],//80-90
[2000,0],//90-00

[2010,0],//2000-2010
[2020,0]//2010-2020
];

var dataEurope = [
[1500,0],//1500年以前的
[1510,0],//1500-1510
[1520,0],//1510-1520
[1530,0],//1520-1530
[1540,0],//1530-1540
[1550,0],//1540-1550
[1560,1],//1550-1560
[1570,0],//1560-1570
[1580,0],//1570-1580
[1590,1],//1580-1590
[1600,0],//1590-1600

[1610,0],//1600-1610
[1620,0],//10-20
[1630,0],//20-30
[1640,0],//30-40
[1650,0],//40-50
[1660,0],//50-60
[1670,0],//60-70
[1680,0],//70-80
[1690,0],//80-90
[1700,0],//90-00

[1710,3],//1700-1710
[1720,0],//10-20
[1730,1],//20-30
[1740,2],//30-40
[1750,0],//40-50
[1760,2],//50-60
[1770,2],//60-70;
[1780,0],//70-80
[1790,1],//80-90
[1800,0],//90-00

[1810,0],//1800-1810
[1820,3],//10-20
[1830,0],//20-30
[1840,2],//30-40
[1850,0],//40-50
[1860,1],//50-60
[1870,14],//60-70
[1880,8],//70-80
[1890,9],//80-90
[1900,0],//90-00

[1910,0],//1900-1910
[1920,14],//10-20
[1930,0],//20-30
[1940,0],//30-40
[1950,27],//40-50
[1960,0],//50-60
[1970,30],//60-70
[1980,0],//70-80
[1990,50],//80-90
[2000,0],//90-00

[2010,0],//2000-2010
[2020,0]//2010-2020
];

var dataIO = [
[1500,0],//1500年以前的
[1510,0],//1500-1510
[1520,0],//1510-1520
[1530,0],//1520-1530
[1540,0],//1530-1540
[1550,0],//1540-1550
[1560,0],//1550-1560
[1570,0],//1560-1570
[1580,0],//1570-1580
[1590,0],//1580-1590
[1600,0],//1590-1600

[1610,0],//1600-1610
[1620,0],//10-20
[1630,0],//20-30
[1640,0],//30-40
[1650,0],//40-50
[1660,0],//50-60
[1670,0],//60-70
[1680,0],//70-80
[1690,0],//80-90
[1700,0],//90-00

[1710,0],//1700-1710
[1720,0],//10-20
[1730,0],//20-30
[1740,0],//30-40
[1750,0],//40-50
[1760,0],//50-60
[1770,0],//60-70;
[1780,0],//70-80
[1790,0],//80-90
[1800,0],//90-00

[1810,0],//1800-1810
[1820,0],//10-20
[1830,0],//20-30
[1840,0],//30-40
[1850,0],//40-50
[1860,0],//50-60
[1870,0],//60-70
[1880,7],//70-80
[1890,15],//80-90
[1900,0],//90-00

[1910,0],//1900-1910
[1920,0],//10-20
[1930,0],//20-30
[1940,0],//30-40
[1950,0],//40-50
[1960,0],//50-60
[1970,0],//60-70
[1980,0],//70-80
[1990,0],//80-90
[2000,0],//90-00

[2010,92],//2000-2010
[2020,0]//2010-2020
];

var dataNA = [
[1500,1],//1500年以前的
[1510,0],//1500-1510
[1520,0],//1510-1520
[1530,0],//1520-1530
[1540,0],//1530-1540
[1550,0],//1540-1550
[1560,0],//1550-1560
[1570,0],//1560-1570
[1580,0],//1570-1580
[1590,0],//1580-1590
[1600,0],//1590-1600

[1610,0],//1600-1610
[1620,0],//10-20
[1630,0],//20-30
[1640,0],//30-40
[1650,0],//40-50
[1660,0],//50-60
[1670,0],//60-70
[1680,0],//70-80
[1690,0],//80-90
[1700,0],//90-00

[1710,0],//1700-1710
[1720,0],//10-20
[1730,0],//20-30
[1740,0],//30-40
[1750,2],//40-50
[1760,0],//50-60
[1770,0],//60-70;
[1780,2],//70-80
[1790,0],//80-90
[1800,0],//90-00

[1810,1],//1800-1810
[1820,5],//10-20
[1830,0],//20-30
[1840,6],//30-40
[1850,4],//40-50
[1860,9],//50-60
[1870,0],//60-70
[1880,12],//70-80
[1890,27],//80-90
[1900,26],//90-00

[1910,64],//1900-1910
[1920,50],//10-20
[1930,41],//20-30
[1940,60],//30-40
[1950,0],//40-50
[1960,0],//50-60
[1970,93],//60-70
[1980,0],//70-80
[1990,142],//80-90
[2000,291],//90-00

[2010,103],//2000-2010
[2020,449]//2010-2020
];
var dataOceania = [
[1500,1],//1500年以前的
[1510,0],//1500-1510
[1520,0],//1510-1520
[1530,0],//1520-1530
[1540,0],//1530-1540
[1550,0],//1540-1550
[1560,0],//1550-1560
[1570,0],//1560-1570
[1580,0],//1570-1580
[1590,0],//1580-1590
[1600,0],//1590-1600

[1610,0],//1600-1610
[1620,0],//10-20
[1630,0],//20-30
[1640,0],//30-40
[1650,0],//40-50
[1660,0],//50-60
[1670,0],//60-70
[1680,0],//70-80
[1690,0],//80-90
[1700,0],//90-00

[1710,0],//1700-1710
[1720,0],//10-20
[1730,0],//20-30
[1740,0],//30-40
[1750,0],//40-50
[1760,0],//50-60
[1770,0],//60-70;
[1780,0],//70-80
[1790,1],//80-90
[1800,1],//90-00

[1810,3],//1800-1810
[1820,0],//10-20
[1830,0],//20-30
[1840,7],//30-40
[1850,21],//40-50
[1860,24],//50-60
[1870,21],//60-70
[1880,49],//70-80
[1890,60],//80-90
[1900,93],//90-00

[1910,45],//1900-1910
[1920,79],//10-20
[1930,145],//20-30
[1940,182],//30-40
[1950,150],//40-50
[1960,354],//50-60
[1970,187],//60-70
[1980,179],//70-80
[1990,0],//80-90
[2000,126],//90-00

[2010,501],//2000-2010
[2020,247]//2010-2020
];
var dataPacific = [
[1500,0],//1500年以前的
[1510,0],//1500-1510
[1520,0],//1510-1520
[1530,0],//1520-1530
[1540,0],//1530-1540
[1550,0],//1540-1550
[1560,0],//1550-1560
[1570,0],//1560-1570
[1580,0],//1570-1580
[1590,0],//1580-1590
[1600,0],//1590-1600

[1610,0],//1600-1610
[1620,0],//10-20
[1630,0],//20-30
[1640,0],//30-40
[1650,0],//40-50
[1660,0],//50-60
[1670,0],//60-70
[1680,0],//70-80
[1690,0],//80-90
[1700,0],//90-00

[1710,0],//1700-1710
[1720,0],//10-20
[1730,0],//20-30
[1740,0],//30-40
[1750,0],//40-50
[1760,0],//50-60
[1770,0],//60-70;
[1780,0],//70-80
[1790,0],//80-90
[1800,0],//90-00

[1810,0],//1800-1810
[1820,0],//10-20
[1830,0],//20-30
[1840,3],//30-40
[1850,0],//40-50
[1860,0],//50-60
[1870,0],//60-70
[1880,0],//70-80
[1890,0],//80-90
[1900,0],//90-00

[1910,0],//1900-1910
[1920,0],//10-20
[1930,0],//20-30
[1940,0],//30-40
[1950,0],//40-50
[1960,42],//50-60
[1970,0],//60-70
[1980,0],//70-80
[1990,0],//80-90
[2000,0],//90-00

[2010,0],//2000-2010
[2020,0]//2010-2020
];

var dataSA = [
[1500,0],//1500年以前的
[1510,0],//1500-1510
[1520,0],//1510-1520
[1530,0],//1520-1530
[1540,0],//1530-1540
[1550,1],//1540-1550
[1560,0],//1550-1560
[1570,0],//1560-1570
[1580,0],//1570-1580
[1590,0],//1580-1590
[1600,0],//1590-1600

[1610,0],//1600-1610
[1620,0],//10-20
[1630,0],//20-30
[1640,0],//30-40
[1650,0],//40-50
[1660,0],//50-60
[1670,0],//60-70
[1680,0],//70-80
[1690,0],//80-90
[1700,0],//90-00

[1710,0],//1700-1710
[1720,0],//10-20
[1730,0],//20-30
[1740,0],//30-40
[1750,0],//40-50
[1760,0],//50-60
[1770,0],//60-70;
[1780,0],//70-80
[1790,0],//80-90
[1800,0],//90-00

[1810,0],//1800-1810
[1820,0],//10-20
[1830,3],//20-30
[1840,0],//30-40
[1850,0],//40-50
[1860,0],//50-60
[1870,0],//60-70
[1880,0],//70-80
[1890,0],//80-90
[1900,11],//90-00

[1910,0],//1900-1910
[1920,0],//10-20
[1930,0],//20-30
[1940,0],//30-40
[1950,27],//40-50
[1960,0],//50-60
[1970,30],//60-70
[1980,0],//70-80
[1990,55],//80-90
[2000,0],//90-00

[2010,112],//2000-2010
[2020,0]//2010-2020
];



var schema = [
    {name: 'date', index: 0, text: '年代'},
    {name: 'times', index: 1, text: '攻击次数'}

];


var itemStyle = {
    normal: {
        opacity: 0.8,
        shadowBlur: 10,
        shadowOffsetX: 0,
        shadowOffsetY: 0,
        shadowColor: 'rgba(0, 0, 0, 0.5)',
        symbolSize:25
    }
};

option = {
    backgroundColor: '#fff',
    color: [
       '#FF6600', '#fec42c', '#80F1BE',
       '#CC33FF', '#666FF0', '#00FF66',
       '#dd4444', '#D2691E', '#996633'
    ],
    title: {
            text :'各洲攻击事件数随时间变化情况',
            subtext:'data from kaggle',
            x:'center',
            y:'top',
    	    textStyle: {
            color: '#000',
            fontSize: 20
        },subtextStyle: {
            color: '#000',
            fontSize: 15
        }
    },
    legend: {
        y: '10%',
        data: ['Africa', 'Asia', 'Atlantic','Europe','Indian Ocean','North America ','Oceania','Pacific','South America'],
        textStyle: {
            color: '#000',
            fontSize: 12
        }
    },
    grid: {
        x: '10%',
        x2: 150,
        y: '18%',
        y2: '10%'
    },
    tooltip: {
        padding: 10,
        backgroundColor: '#222',
        borderColor: '#fff',
        borderWidth: 1,
        formatter: function (obj) {
            var value = obj.value;
            return '<div style="border-bottom: 1px solid rgba(255,255,255,.3); font-size: 18px;padding-bottom: 7px;margin-bottom: 7px">'
                + obj.seriesName + ' '+(value[0]-10) +'-'+ value[0] + '年'

                + '</div>'
                + schema[1].text + '：' + value[1] + '<br>';
                // + schema[2].text + '：' + value[2] + '<br>'
                // + schema[3].text + '：' + value[3] + '<br>'
                // + schema[4].text + '：' + value[4] + '<br>'
                // + schema[5].text + '：' + value[5] + '<br>'
                // + schema[6].text + '：' + value[6] + '<br>';
        }
    },
    xAxis: {
        type: 'value',
        name: '年代',
        nameGap: 16,
        nameTextStyle: {
            color: '#000',
            fontSize: 14
        },
        min:1500,
        max: 2020,
        splitLine: {
            show: false
        },
        axisLine: {
            lineStyle: {
                color: '#000'
            }
        }
    },
    yAxis: {
        type: 'value',
        name: '攻击次数',
        nameLocation: 'end',
        max: 600,
        nameGap: 20,
        nameTextStyle: {
            color: '#000',
            fontSize: 16
        },
        axisLine: {
            lineStyle: {
                color: '#000'
            }
        },
        splitLine: {
            show: false
        }
    },
   /* visualMap: [
        {
            left: 'right',
            top: '10%',
            dimension: 2,
            min: 0,
            max: 250,
            itemWidth: 30,
            itemHeight: 120,
            calculable: true,
            precision: 0.1,
            text: ['圆形大小：PM2.5'],
            textGap: 30,
            textStyle: {
                color: '#fff'
            },
            inRange: {
                symbolSize: [10, 70]
            },
            outOfRange: {
                symbolSize: [10, 70],
                color: ['rgba(255,255,255,.2)']
            },
            controller: {
                inRange: {
                    color: ['#c23531']
                },
                outOfRange: {
                    color: ['#444']
                }
            }
        },
        {
            left: 'right',
            bottom: '5%',
            dimension: 2,
            min: 0,
            max: 50,
            itemWidth: 30,
            itemHeight: 120,
            calculable: true,
            precision: 0.1,
            text: ['明暗：二氧化硫'],
            textGap: 30,
            textStyle: {
                color: '#fff'
            },
            inRange: {
                colorLightness: [1, 0.5]
            },
            outOfRange: {
                color: ['rgba(255,255,255,.2)']
            },
            controller: {
                inRange: {
                    color: ['#c23531']
                },
                outOfRange: {
                    color: ['#444']
                }
            }
        }
    ],*/
    series: [
        {
            name: 'Africa',
            type: 'scatter',
            itemStyle: itemStyle,
            symbolSize:function(data,params){
                    var count = data[1];
                    if(count){
                        if(count < 10){
                            return 6;
                        }
                        else if(count >= 10 && count < 100){
                            return 9;
                        }
                        else if(count >= 100 && count < 200){
                            return 12;
                        }
                        else{
                            return 15;
                        }
                    }
                    else{
                        return 0;
                    }           
        },
            data: dataAfrica
        },
        {
            name: 'Asia',
            type: 'scatter',
            symbolSize:function(data,params){
                    var count = data[1];
                    if(count){
                        if(count < 10){
                            return 6;
                        }
                        else if(count >= 10 && count < 100){
                            return 9;
                        }
                        else if(count >= 100 && count < 200){
                            return 12;
                        }
                        else{
                            return 15;
                        }
                    }
                    else{
                        return 0;
                    }           
        },
            itemStyle: itemStyle,
            data: dataAsia
        },
        {
            name: 'Atlantic',
            type: 'scatter',
            symbolSize:function(data,params){
                    var count = data[1];
                    if(count){
                        if(count < 10){
                            return 6;
                        }
                        else if(count >= 10 && count < 100){
                            return 9;
                        }
                        else if(count >= 100 && count < 200){
                            return 12;
                        }
                        else{
                            return 15;
                        }
                    }
                    else{
                        return 0;
                    }           
        },
            itemStyle: itemStyle,
            data: dataAtlantic
        },
        {
            name: 'Europe',
            type: 'scatter',
            symbolSize:function(data,params){
                    var count = data[1];
                    if(count){
                        if(count < 10){
                            return 6;
                        }
                        else if(count >= 10 && count < 100){
                            return 9;
                        }
                        else if(count >= 100 && count < 200){
                            return 12;
                        }
                        else{
                            return 15;
                        }
                    }
                    else{
                        return 0;
                    }           
        },
            itemStyle: itemStyle,
            data: dataEurope
        },
        {
            name: 'Indian Ocean',
            type: 'scatter',
            symbolSize:function(data,params){
                    var count = data[1];
                    if(count){
                        if(count < 10){
                            return 6;
                        }
                        else if(count >= 10 && count < 100){
                            return 9;
                        }
                        else if(count >= 100 && count < 200){
                            return 12;
                        }
                        else{
                            return 15;
                        }
                    }
                    else{
                        return 0;
                    }           
        },
            itemStyle: itemStyle,
            data: dataIO
        },
        {
            name: 'North America',
            type: 'scatter',
            symbolSize:function(data,params){
                    var count = data[1];
                    if(count){
                        if(count < 10){
                            return 6;
                        }
                        else if(count >= 10 && count < 100){
                            return 9;
                        }
                        else if(count >= 100 && count < 200){
                            return 12;
                        }
                        else{
                            return 15;
                        }
                    }
                    else{
                        return 0;
                    }           
        },
            itemStyle: itemStyle,
            data: dataNA
        },    
        {
            name: 'Oceania',
            type: 'scatter',
             symbol:"circle",
            symbolSize:function(data,params){
                    var count = data[1];
                    if(count){
                        if(count < 10){
                            return 6;
                        }
                        else if(count >= 10 && count < 100){
                            return 9;
                        }
                        else if(count >= 100 && count < 200){
                            return 12;
                        }
                        else{
                            return 15;
                        }
                    }
                    else{
                        return 0;
                    }           
        },
            itemStyle: itemStyle,
            data: dataOceania
        },
        {
            name: 'Pacific',
            type: 'scatter',
            symbol:"circle",
            symbolSize:function(data,params){
                    var count = data[1];
                    if(count){
                        if(count < 10){
                            return 6;
                        }
                        else if(count >= 10 && count < 100){
                            return 9;
                        }
                        else if(count >= 100 && count < 200){
                            return 12;
                        }
                        else{
                            return 15;
                        }
                    }
                    else{
                        return 0;
                    }           
        },
            itemStyle: itemStyle,
            data: dataPacific
        },
        {
            name: 'South America',
            type: 'scatter',
            symbolSize:function(data,params){
                    var count = data[1];
                    if(count){
                        if(count < 10){
                            return 6;
                        }
                        else if(count >= 10 && count < 100){
                            return 9;
                        }
                        else if(count >= 100 && count < 200){
                            return 12;
                        }
                        else{
                            return 15;
                        }
                    }
                    else{
                        return 0;
                    }           
        },
            itemStyle: itemStyle,
            data: dataSA
        }



    ]
};
// 使用刚指定的配置项和数据显示图表。
myChart.setOption(option);
</script>
<!--div>
   <footer>
      <p><strong>Action © 2017vis we</strong></p>
   </footer>
</div-->
</body>
</html>